# Label Utils Get Label For Spec Method

Source: https://www.revitapidocs.com/2026/5f0e82b9-cf62-062d-5136-3c4032cca766.htm

---

| Label Utils Get Label For Spec Method |
| --- |

Gets the user\-visible name for a spec.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static string GetLabelForSpec(
	ForgeTypeId specTypeId
)
```

```
Public Shared Function GetLabelForSpec (
	specTypeId As ForgeTypeId
) As String
```

```
public:
static String^ GetLabelForSpec(
	ForgeTypeId^ specTypeId
)
```

```
static member GetLabelForSpec :
        specTypeId : ForgeTypeId -> string
```

#### Parameters

specTypeId ForgeTypeId
:   Identifier of the spec to get the user\-visible name.

#### Return Value

String
Returns the user\-visible name for a spec. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The given identifier is neither a spec nor a category. |
| ArgumentNullException | A non\-optional argument was null |

Remarks The name is obtained in the current Revit language.
 If the given identifier is a category, this method returns the name
 of the Family Type spec with that category, e.g. "Family Type: Walls". See Also

#### Reference

LabelUtils Class Autodesk.Revit.DB Namespace